# NumLayers

## Description
Function NumLayers returns the current number of layers within the active document.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION NumLayers : INTEGER;
```

```python

def vs.NumLayers():
    return INTEGER
```

## Version
Availability: from MiniCAD
## Category
* Layers